// 4. Створити функцію, яка прибирає з рядка всі символи, які ми передали після другого аргумента. 'func("hello world", 'l', 'd')' поверне нам "heo wor". Вихідний рядок та символи для видалення задає користувач.
// Також забезпечити логіку, при котрій після першого елементу ми можемо передати будь яким аргументом функцію, яка щось достать до нашого рядка, ГОЛОВНЕ щоб функція виконувалася після того як ми проведемо попередні маніпуляції (тобто видалимо символи). 
let str = prompt('Введите предложение')
let a = prompt('Введите букву')
let b = prompt('Введите букву')

function changed(){
    console.log(str.replaceAll(a, '').replaceAll(b, ''))
}
changed();

// Можливо додавати будь яку логіку в цю кастомну функцію.
// Приклад:
// const formatter = (string) => string.toUpperCase()
// func("hello world", 'l', 'd', 'o', 'h', formatter) 
// або 
// func("hello world", 'l', 'd', formatter, 'o', 'h') // тут output функції не має змінитися